# Lab 3: Advanced Pandas Indexing & FeatureTransformation

### Task 1

In [2]:
import pandas as pd

df = pd.read_csv('train.csv')
copied_df = df.copy()

embarked = copied_df['Embarked'] # Series one [], Datatype two [[]]

embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

### Task 2

In [6]:
embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

### Task 3

In [86]:
number_of_nulls = embarked.isnull().sum()
percentage_of_nulls = number_of_nulls * 100 / len(copied_df)

print('Number of nulls: {0} \nPercentage of nulls: {1}'.format(number_of_nulls, percentage_of_nulls))

Number of nulls: 2
Percentage of nulls: 0.2244668911335578

### Task 4

In [87]:
limited_passid = copied_df[copied_df['PassengerId'] > 880]

limited_passid

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Task 5

In [88]:
embarked_isnull = copied_df[embarked.isnull()]

embarked_isnull

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

### Task 6

In [123]:
drop_nan = copied_df.dropna(axis=0, subset=['Embarked'])

drop_nan.iloc[[829, 61]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.750,NaN,S
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.00,1,0,36973,83.475,C83,S

### Task 7